{
    "id": "dohnadohna",
    "name": "Dohna Dohna",
    "url": "./headers/dohnadohna.jpg",
    "tags": ["RPG", "VN", "Management", "Static CG", "Urban", "Male Protagonist", "Loli", "Thicc", "Rape", "Corruption", "Prostitution"],
    "stags": ["Approved", "Extreme"],
    "images": [
        "./game_images/dohnadohna/1.jpeg",
        "./game_images/dohnadohna/2.gif",
        "./game_images/dohnadohna/3.jpg",
        "./game_images/dohnadohna/4.jpg",
        "./game_images/dohnadohna/5.jpg",
        "./game_images/dohnadohna/6.jpg"
    ],
    "date": "2020-11-27",
    "lang": {
        "status": "English",
        "patch": false
    },
    "censored": {
        "status": true,
        "patch": false
    },
    "status": "Completed",
    "dev": [
        {
        "name": "Alicesoft",
        "url": "https://www.alicesoft.com/dohnadohna/"
        }
    ],
    "dl": [
        {
            "name": "Official Download",
            "url": "https://www.johren.games/games/download/dohna-dohna-en/"
        },
        {
            "name": "nyaa.si",
            "url": "https://sukebei.nyaa.si/view/3500585"
        }
    ],
    "description": "Dohna Dohna has to be the wildest mix of VN meets RPG meets Management Game I have seen so far. Now, don't get me wrong, whatever morality I still have left inside me is telling me to not praise this game, but that little voice inside my (probably insane) head aside, this game is pretty amazing.<br><br>In Dohna Dohna you follow a small gang consisting of absolute lunatics rescuing a brainwashed city from the claws of evil while dealing with the antics of other gangs. And in order to stay afloat, they, obviously, resort to kidnapping girls and prostituting them. Because... yes. Throughout the game you will encounter more and more misguided (or simply astray) characters who will eventually end up joining the gang. Suffice to say, if they're female, chance is high you can fuck them. There are 8 endings in total, out of which 6 are unique heroine endings.<br><br>A small heads up if you find the prostitution part a bit questionable (which you should) - it's more or less optional and only results in slightly more money than if you were to play the game without it. If you do end up playing that aspect too once in a while, it gives you the option to watch some prostitution-related side stories with certain special characters you encounter throughout the game.<br><br>Some other things:<br>- There is a day counter, but it is fairly irrelevant as there is no day limit. There are achievements however if you manage to beat the game under a certain number of days.<br>- The music in this game is an absolute bop, I still occasionally listen to it on YouTube.<br>- Yes, that loli's really called Porno."
}